app/controllers/school_classes_controller.rb

  def create
    @school_class = SchoolClass.create(school_class_params(:title, :room_number))
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Eating"], ["room_number", 5], ["created_at", "2020-10-13 13:08:06.783370"], ["updated_at", "2020-10-13 13:08:06.783370"]]

  def update
    @school_class = SchoolClass.find(params[:id])
    @school_class.update(school_class_params(:title, :room_number))
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "school_classes" SET "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["room_number", 4], ["updated_at", "2020-10-13 13:07:31.864709"], ["id", 1]]